### START

### INTRODUCTION TO PANDAS PYTHON LIBRARY

1 pandas is the python library which represents the data in tabular form

2 pandas allows us to import the datasets from the csv or excel or SQL database data source

3 data cleaning involves the filling of missing values and replacing the invalid values 

4 missing value is null value and invalid value is when we get the incorrect data when we check the context

5 pandas have size mutability that means we can easily add or remove the columns and rows

6 we can reshape pivot manupulate extract our dataset as needed and also perform the statistic  analysis

### IMPORTING PANDAS LIBRARY

In [2]:
import pandas as pd

### DATA STRUCTURES IN PANDAS 
data structure is the collection of datatypes that provides the best way to organise the items or values interms of memory usage conbination to There are two types of data struture in pandas and they are series and data frame. 

The series is the one dimensional data struture and data frma eis two dimensional data struture 

The series represent only one column of the dataset and data frame represents entire dataset

SERIES DATASTRUTURE IN PANDAS

1 series represents the one dimensionaal data struture which can only hold one column from the dataset 

2 series will be the values of a particular column infront of which the index of the value is given. index always starts with 0

3 series contains only one column and yoiu can extend the rows as many as you want 

4 series is a homogeneous data struture that means it can only hold one kind of datatype and if we add another data type previous values of the series will be converted to current datatype 

5 datatype of the integer value is integer and object is the data type of string and only these two data types can be there in the series 

6 series is size immutable that means you cannot delete the row in series and if you remove the values then it will create new series with those values and will not change the original series

DATA FRAMES DATA STRUTURE IN PANDAS

1 data frame is two dimensional data struture which contains the rows and columns in it 

2 in data frame you can increase the number of rows and columns as well 

3 it is size mutable which means you can delete update or append the coulmns and rows 

4 its a heterogenous data struture which means you can have multiple data types in single column as well

### CREATING SERIES IN PANDAS
when we create the series using pandas we get the index values and data type of the series as output and we use series function of pandas to create the series data struture

creating array using the list

In [25]:
s1=pd.Series([10,20,30,40,50])
print(s1)

0    10
1    20
2    30
3    40
4    50
dtype: int64

### PROPERTIES OF THE SERIES 
There are several properties of the series which can be checked such as data type values name and index of the series as given below 

initially the name of series is none and we can assign the desired name to series and when we access the series after that it will be denoted by that name

In [46]:
print(s1.dtype)
print(s1.values)
print(s1.index)
print(s1.name)
s1.name="calaries"
print(s1.name)
print(s1)

int64
[10 20 30 40 50]
RangeIndex(start=0, stop=5, step=1)
Numbers
calaries
0    10
1    20
2    30
3    40
4    50
Name: calaries, dtype: int64

### INDEXING IN SERIES DATA STRUTURE IN PANDAS

indexing in series is same like the python lists or numpy arrays. In series you can see the values at certain index based on range you give the start index and end index where end index is not including

In [28]:
s2=pd.Series([1,2,3,4,5])
print(s2[0])
print(s2[0:3])
print(s2[1:3])

1
0    1
1    2
2    3
dtype: int64
1    2
2    3
dtype: int64

indexing using the iloc function which does indexing based on location of the value so iloc function does the location based indexing which means it will use indexes 0,1,2,3,4 etc

In [44]:
print(s1.iloc[2])
print(s2.iloc[2])

30
3

iloc function is used when you want multiple values which are on different numerical indexes as given below

In [45]:
print(s2.iloc[[2,3]])

2    3
3    4
dtype: int64

### CUSTOM INDEXING IN SERIES

custom indexing is done in series when you dont want palin number as indext of the values and want to put some other data as index so that the series makes more sense.

we create the list and assign the list to series index to perform the custom indexing

custom indexing is done to represent the c=indexes in the more meaningful way so that the coulmn gives important info

In [51]:
print(s1)
idx=['apple','mango','banana','orange','pineapple']
s1.index=idx
print(s1)

0    10
1    20
2    30
3    40
4    50
Name: calaries, dtype: int64
apple        10
mango        20
banana       30
orange       40
pineapple    50
Name: calaries, dtype: int64

finding values of the series using custom indexes

In [56]:
print(s1['apple'])

10

iloc function is used to get the values at the numerical indexes but not for string indexes. For string indexing or custom indexing which is not number you can using loc function as given below 

remember that in label based indexing both start and end index is inclued where as in location based indexing end value is not incliuded

In [58]:
print(s1.loc[['apple','mango']])
print(s1.loc[['apple','mango','pineapple']])

apple    10
mango    20
Name: calaries, dtype: int64
apple        10
mango        20
pineapple    50
Name: calaries, dtype: int64

### CREATING SERIES USING PYTHON DICTIONARY

In [ ]:
fruit_protein={
    'apple':0.5,
    'mango':1,
    'banana':1.5,
    'orange':2,
    'seetafal':2.5}
s3=pd.Series(fruit_protein)
s3.name='protein'
print(s3)

apple       0.5
mango       1.0
banana      1.5
orange      2.0
seetafal    2.5
Name: protein, dtype: float64

In [67]:
print(s3.index)
print(s3.dtype)
print(s3.values)
print(s3['seetafal'])
print(s3[['mango','banana','orange']])

Index(['apple', 'mango', 'banana', 'orange', 'seetafal'], dtype='object')
float64
[0.5 1.  1.5 2.  2.5]
2.5
mango     1.0
banana    1.5
orange    2.0
Name: protein, dtype: float64

### CONDTIONAL SELECTION IN SERIES

conditional selection is when you want to find out the data which is satisfying a particular condition you can directly use the condition on the entire series 

when we put a conition on series it returns mask series which can be then used inside the series to get the values

In [74]:
m=s3>1
s3[m]

banana      1.5
orange      2.0
seetafal    2.5
Name: protein, dtype: float64

### LOGICAL OPERATORS FOR PANDAS SERIES
logical operators are logical and logical or and logical not which can be used on series as well. We use & for and operator and | for or perator

for logical and we must have both condition true to get true result where as for or operator we need any one condition to be true to the output based on that true condition

In [93]:
mask=s3[(s3>0.5)&(s3<2)]
print(mask)

mango     1.0
banana    1.5
Name: protein, dtype: float64

In [94]:
mask=s3[(s3>0.5) | (s3<2)]
print(mask)

apple       0.5
mango       1.0
banana      1.5
orange      2.0
seetafal    2.5
Name: protein, dtype: float64

In [95]:
print(s3[s3!=1])

apple       0.5
banana      1.5
orange      2.0
seetafal    2.5
Name: protein, dtype: float64

### MODIFYING THE DATA IN PANDAS SERIES 
The data in the series can also be modified as we do normally for list or numpy arrays using the location or lebel index

In [96]:
s3["mango"]=4
print(s3)

apple       0.5
mango       4.0
banana      1.5
orange      2.0
seetafal    2.5
Name: protein, dtype: float64

### DATAFRAME DATA STRUCTURE IN PANDAS

we can convert the dictionary into data frames so that they can be easily be represented properly in the form of table. A dataframe is a two dimensional data struture in pandas where rows and columns both are accepted

In [11]:
data={
    'names':['sagar','rahul','akshay','reshma','divya','ramesh','suresh'],
    'Age':[34,31,33,28,25,54,45],
    'department':['IT','HR','Finance','Admin','marketing','sales','managemnt']
}
empdata=pd.DataFrame(data)
print(empdata)

    names  Age department
0   sagar   34         IT
1   rahul   31         HR
2  akshay   33    Finance
3  reshma   28      Admin
4   divya   25  marketing
5  ramesh   54      sales
6  suresh   45  managemnt

### ACCESSING TOP AND BOTTOM ITESM OF DATAFRAME
Head and tail functions are used to get the top or bottom values from the data frame

In [12]:
empdata.head(3)

    names  Age department
0   sagar   34         IT
1   rahul   31         HR
2  akshay   33    Finance

In [13]:
empdata.tail(3)

    names  Age department
4   divya   25  marketing
5  ramesh   54      sales
6  suresh   45  managemnt

### INDEXING IN DATA FRAME 
The iloc and loc functions can be used for indexing in data frame for accessing the different values based on index iloc is used to get values at index and loc is used to fetch the selected coulmns from the entire dataframe 

iloc: gives all the columns of the data frame for specified indexes 

loc: gives the only selected columns within specified range of index

In [18]:
empdata.iloc[0:3]

    names  Age department
0   sagar   34         IT
1   rahul   31         HR
2  akshay   33    Finance

In [25]:
empdata.loc[0:2,['Age','department']]

   Age department
0   34         IT
1   31         HR
2   33    Finance

### NOTE: 
Always make sure to use the column names as defined in dataframe including the casing whem ujsing iloc function we must pass rows, columns inside it for getting the desired result

accessing individualcolumns of the data frame 
To access the particular column in the dataframe yoo can use dataframe.column name and that particular coulmn will show all the rows of the dataframe